In [66]:
import pandas as pd
import numpy as np

data = {
    "employee_id": [101,102,103,104,105,105,106,107,108,109,110,111,112,113,114],
    "name": ["Rahim","Karim","Ayesha","John","Maria","Maria","Sohan","Nila","Arif","Tania","Hasan","Rupa","Imran","Lima","Sadia"],
    "age": [25,30,np.nan,"35",28,28,45,23,120,29,31,None,27,26,24],
    "gender": ["Male","male","Female","M","F","F","Male","female","Male","Female","Male","M","Male","Female","female"],
    "city": ["dhaka","Dhaka","Chittagong","dhaka","Khulna","Khulna","Rajshahi","Sylhet","Dhaka","dhaka","Barisal","barisal","Sylhet","Khulna","Dhaka"],
    "salary": [30000,40000,50000,60000,55000,55000,200000,28000,32000,45000,47000,1000000,38000,42000,39000],
    "experience": [1,5,7,10,6,6,20,1,2,4,5,15,3,4,2],
    "join_date": ["2021-01-10","2020/05/20","2019-07-15","2018-03-01","2019-11-11",
                  "2019-11-11","2010-06-01","2022-02-02","2023-01-01",
                  "2020-08-08","2019-09-09","2005-01-01","2021-12-12",
                  "2022-07-07","2023-03-03"],
    "department": ["IT","HR","IT","Finance","HR","HR","Management","IT","IT","Finance","IT","Management","HR","HR","IT"],
    "performance_score": [4.5,4.0,3.8,np.nan,4.2,4.2,4.9,3.5,2.0,3.9,4.1,None,3.6,3.7,3.8]
}

df = pd.DataFrame(data)

df.to_csv("practice_dataset.csv", index=False)

print("✅ practice_dataset.csv created successfully")

✅ practice_dataset.csv created successfully

### Dataloading
Read data

In [67]:
import pandas as pd


df = pd.read_csv('practice_dataset.csv')
df.head()

,employee_id,name,age,gender,city,salary,experience,join_date,department,performance_score
0,101,Rahim,25.0,Male,dhaka,30000,1,2021-01-10,IT,4.5
1,102,Karim,30.0,male,Dhaka,40000,5,2020/05/20,HR,4.0
2,103,Ayesha,NaN,Female,Chittagong,50000,7,2019-07-15,IT,3.8
3,104,John,35.0,M,dhaka,60000,10,2018-03-01,Finance,NaN
4,105,Maria,28.0,F,Khulna,55000,6,2019-11-11,HR,4.2

### data inspection(understanding data)
basic info

In [68]:
df.head()

,employee_id,name,age,gender,city,salary,experience,join_date,department,performance_score
0,101,Rahim,25.0,Male,dhaka,30000,1,2021-01-10,IT,4.5
1,102,Karim,30.0,male,Dhaka,40000,5,2020/05/20,HR,4.0
2,103,Ayesha,NaN,Female,Chittagong,50000,7,2019-07-15,IT,3.8
3,104,John,35.0,M,dhaka,60000,10,2018-03-01,Finance,NaN
4,105,Maria,28.0,F,Khulna,55000,6,2019-11-11,HR,4.2

In [69]:
df.tail()

,employee_id,name,age,gender,city,salary,experience,join_date,department,performance_score
10,110,Hasan,31.0,Male,Barisal,47000,5,2019-09-09,IT,4.1
11,111,Rupa,NaN,M,barisal,1000000,15,2005-01-01,Management,NaN
12,112,Imran,27.0,Male,Sylhet,38000,3,2021-12-12,HR,3.6
13,113,Lima,26.0,Female,Khulna,42000,4,2022-07-07,HR,3.7
14,114,Sadia,24.0,female,Dhaka,39000,2,2023-03-03,IT,3.8

In [70]:
df.shape

(15, 10)

In [71]:
df.columns

Index(['employee_id', 'name', 'age', 'gender', 'city', 'salary', 'experience',
       'join_date', 'department', 'performance_score'],
      dtype='object')

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   employee_id        15 non-null     int64
 1   name               15 non-null     object
 2   age                13 non-null     float64
 3   gender             15 non-null     object
 4   city               15 non-null     object
 5   salary             15 non-null     int64
 6   experience         15 non-null     int64
 7   join_date          15 non-null     object
 8   department         15 non-null     object
 9   performance_score  13 non-null     float64
dtypes: float64(2), int64(3), object(5)
memory usage: 1.3+ KB

In [73]:
df.describe()

       employee_id         age          salary  experience  performance_score
count    15.000000   13.000000       15.000000   15.000000          13.000000
mean    107.333333   36.230769   117400.000000    6.066667           3.861538
std       4.082483   25.804243   247657.540048    5.311264           0.676435
min     101.000000   23.000000    28000.000000    1.000000           2.000000
25%     104.500000   26.000000    38500.000000    2.500000           3.700000
50%     107.000000   28.000000    45000.000000    5.000000           3.900000
75%     110.500000   31.000000    55000.000000    6.500000           4.200000
max     114.000000  120.000000  1000000.000000   20.000000           4.900000

### handling missing data
detect missing values

In [74]:
df.isnull()
df.isnull().sum()

employee_id          0
name                 0
age                  2
gender               0
city                 0
salary               0
experience           0
join_date            0
department           0
performance_score    2
dtype: int64

drop missing values

In [75]:
df.dropna()
df.dropna(axis=1)

,employee_id,name,gender,city,salary,experience,join_date,department
0,101,Rahim,Male,dhaka,30000,1,2021-01-10,IT
1,102,Karim,male,Dhaka,40000,5,2020/05/20,HR
2,103,Ayesha,Female,Chittagong,50000,7,2019-07-15,IT
3,104,John,M,dhaka,60000,10,2018-03-01,Finance
4,105,Maria,F,Khulna,55000,6,2019-11-11,HR
5,105,Maria,F,Khulna,55000,6,2019-11-11,HR
6,106,Sohan,Male,Rajshahi,200000,20,2010-06-01,Management
7,107,Nila,female,Sylhet,28000,1,2022-02-02,IT
8,108,Arif,Male,Dhaka,32000,2,2023-01-01,IT
9,109,Tania,Female,dhaka,45000,4,2020-08-08,Finance
10,110,Hasan,Male,Barisal,47000,5,2019-09-09,IT
11,111,Rupa,M,barisal,1000000,15,2005-01-01,Management
12,112,Imran,Male,Sylhet,38000,3,2021-12-12,HR
13,113,Lima,Female,Khulna,42000,4,2022-07-07,HR
14,114,Sadia,female,Dhaka,39000,2,2023-03-03,IT

In [76]:
df.shape

(15, 10)

In [77]:
df.fillna(0)
df.fillna(df['age'].mean())
df['age'].fillna(df['age'].median())

0      25.0
1      30.0
2      28.0
3      35.0
4      28.0
5      28.0
6      45.0
7      23.0
8     120.0
9      29.0
10     31.0
11     28.0
12     27.0
13     26.0
14     24.0
Name: age, dtype: float64

### Data cleanning
remove duplicates

In [78]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [79]:
df.drop_duplicates(inplace=True)

In [80]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

Rename columns

In [81]:
df.rename(columns={'employee_id':'id'},inplace=True)

In [82]:
df.head(1)

,id,name,age,gender,city,salary,experience,join_date,department,performance_score
0,101,Rahim,25.0,Male,dhaka,30000,1,2021-01-10,IT,4.5

change Data type

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, 0 to 14
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 14 non-null     int64
 1   name               14 non-null     object
 2   age                12 non-null     float64
 3   gender             14 non-null     object
 4   city               14 non-null     object
 5   salary             14 non-null     int64
 6   experience         14 non-null     int64
 7   join_date          14 non-null     object
 8   department         14 non-null     object
 9   performance_score  12 non-null     float64
dtypes: float64(2), int64(3), object(5)
memory usage: 1.2+ KB

In [84]:
df['age'] = df['age'].astype('Int64')

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, 0 to 14
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 14 non-null     int64
 1   name               14 non-null     object
 2   age                12 non-null     Int64
 3   gender             14 non-null     object
 4   city               14 non-null     object
 5   salary             14 non-null     int64
 6   experience         14 non-null     int64
 7   join_date          14 non-null     object
 8   department         14 non-null     object
 9   performance_score  12 non-null     float64
dtypes: Int64(1), float64(1), int64(3), object(5)
memory usage: 1.2+ KB

In [86]:
df['age'] = df['age'].astype('Int8')

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, 0 to 14
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 14 non-null     int64
 1   name               14 non-null     object
 2   age                12 non-null     Int8
 3   gender             14 non-null     object
 4   city               14 non-null     object
 5   salary             14 non-null     int64
 6   experience         14 non-null     int64
 7   join_date          14 non-null     object
 8   department         14 non-null     object
 9   performance_score  12 non-null     float64
dtypes: Int8(1), float64(1), int64(3), object(5)
memory usage: 1.1+ KB

### data selection and indexing
column selection

In [88]:
df['name']

0      Rahim
1      Karim
2     Ayesha
3       John
4      Maria
6      Sohan
7       Nila
8       Arif
9      Tania
10     Hasan
11      Rupa
12     Imran
13      Lima
14     Sadia
Name: name, dtype: object

In [89]:
df[['age','name']]

     age    name
0     25   Rahim
1     30   Karim
2   <NA>  Ayesha
3     35    John
4     28   Maria
6     45   Sohan
7     23    Nila
8    120    Arif
9     29   Tania
10    31   Hasan
11  <NA>    Rupa
12    27   Imran
13    26    Lima
14    24   Sadia

In [90]:
df[['name','age','gender']]

      name   age  gender
0    Rahim    25    Male
1    Karim    30    male
2   Ayesha  <NA>  Female
3     John    35       M
4    Maria    28       F
6    Sohan    45    Male
7     Nila    23  female
8     Arif   120    Male
9    Tania    29  Female
10   Hasan    31    Male
11    Rupa  <NA>       M
12   Imran    27    Male
13    Lima    26  Female
14   Sadia    24  female

In [91]:
df.get('sex')

In [92]:
df.get('sex') # columns name not found not show error when get() method

Row selection

In [93]:
df.loc[0]

id                          101
name                      Rahim
age                          25
gender                     Male
city                      dhaka
salary                    30000
experience                    1
join_date            2021-01-10
department                   IT
performance_score           4.5
Name: 0, dtype: object

In [94]:
df.iloc[2]

id                          103
name                     Ayesha
age                        <NA>
gender                   Female
city                 Chittagong
salary                    50000
experience                    7
join_date            2019-07-15
department                   IT
performance_score           3.8
Name: 2, dtype: object

conditional seletion

In [95]:
df[df['age']<30]

,id,name,age,gender,city,salary,experience,join_date,department,performance_score
0,101,Rahim,25,Male,dhaka,30000,1,2021-01-10,IT,4.5
4,105,Maria,28,F,Khulna,55000,6,2019-11-11,HR,4.2
7,107,Nila,23,female,Sylhet,28000,1,2022-02-02,IT,3.5
9,109,Tania,29,Female,dhaka,45000,4,2020-08-08,Finance,3.9
12,112,Imran,27,Male,Sylhet,38000,3,2021-12-12,HR,3.6
13,113,Lima,26,Female,Khulna,42000,4,2022-07-07,HR,3.7
14,114,Sadia,24,female,Dhaka,39000,2,2023-03-03,IT,3.8

sorting Data

In [96]:
df.sort_values(by='age')
df.sort_values(by='age',ascending=False)

,id,name,age,gender,city,salary,experience,join_date,department,performance_score
8,108,Arif,120,Male,Dhaka,32000,2,2023-01-01,IT,2.0
6,106,Sohan,45,Male,Rajshahi,200000,20,2010-06-01,Management,4.9
3,104,John,35,M,dhaka,60000,10,2018-03-01,Finance,NaN
10,110,Hasan,31,Male,Barisal,47000,5,2019-09-09,IT,4.1
1,102,Karim,30,male,Dhaka,40000,5,2020/05/20,HR,4.0
9,109,Tania,29,Female,dhaka,45000,4,2020-08-08,Finance,3.9
4,105,Maria,28,F,Khulna,55000,6,2019-11-11,HR,4.2
12,112,Imran,27,Male,Sylhet,38000,3,2021-12-12,HR,3.6
13,113,Lima,26,Female,Khulna,42000,4,2022-07-07,HR,3.7
0,101,Rahim,25,Male,dhaka,30000,1,2021-01-10,IT,4.5
14,114,Sadia,24,female,Dhaka,39000,2,2023-03-03,IT,3.8
7,107,Nila,23,female,Sylhet,28000,1,2022-02-02,IT,3.5
2,103,Ayesha,<NA>,Female,Chittagong,50000,7,2019-07-15,IT,3.8
11,111,Rupa,<NA>,M,barisal,1000000,15,2005-01-01,Management,NaN

Filtering Data

In [97]:
df[((df['age']/10 >3) & (df['age']>30))]

,id,name,age,gender,city,salary,experience,join_date,department,performance_score
3,104,John,35,M,dhaka,60000,10,2018-03-01,Finance,NaN
6,106,Sohan,45,Male,Rajshahi,200000,20,2010-06-01,Management,4.9
8,108,Arif,120,Male,Dhaka,32000,2,2023-01-01,IT,2.0
10,110,Hasan,31,Male,Barisal,47000,5,2019-09-09,IT,4.1

### Data Transformation
apply function

In [98]:
df['experience'] = df['experience'].apply(lambda x: x+2)

df.head()

,id,name,age,gender,city,salary,experience,join_date,department,performance_score
0,101,Rahim,25,Male,dhaka,30000,3,2021-01-10,IT,4.5
1,102,Karim,30,male,Dhaka,40000,7,2020/05/20,HR,4.0
2,103,Ayesha,<NA>,Female,Chittagong,50000,9,2019-07-15,IT,3.8
3,104,John,35,M,dhaka,60000,12,2018-03-01,Finance,NaN
4,105,Maria,28,F,Khulna,55000,8,2019-11-11,HR,4.2

map values

In [99]:
df['gender'] = df['gender'].map({'M':'Male',"F":"Female",'Male':"Male","Female":"Female"})

In [100]:
df

,id,name,age,gender,city,salary,experience,join_date,department,performance_score
0,101,Rahim,25,Male,dhaka,30000,3,2021-01-10,IT,4.5
1,102,Karim,30,NaN,Dhaka,40000,7,2020/05/20,HR,4.0
2,103,Ayesha,<NA>,Female,Chittagong,50000,9,2019-07-15,IT,3.8
3,104,John,35,Male,dhaka,60000,12,2018-03-01,Finance,NaN
4,105,Maria,28,Female,Khulna,55000,8,2019-11-11,HR,4.2
6,106,Sohan,45,Male,Rajshahi,200000,22,2010-06-01,Management,4.9
7,107,Nila,23,NaN,Sylhet,28000,3,2022-02-02,IT,3.5
8,108,Arif,120,Male,Dhaka,32000,4,2023-01-01,IT,2.0
9,109,Tania,29,Female,dhaka,45000,6,2020-08-08,Finance,3.9
10,110,Hasan,31,Male,Barisal,47000,7,2019-09-09,IT,4.1
11,111,Rupa,<NA>,Male,barisal,1000000,17,2005-01-01,Management,NaN
12,112,Imran,27,Male,Sylhet,38000,5,2021-12-12,HR,3.6
13,113,Lima,26,Female,Khulna,42000,6,2022-07-07,HR,3.7
14,114,Sadia,24,NaN,Dhaka,39000,4,2023-03-03,IT,3.8

### Feature Engineering
create new column

In [102]:
df['eligible'] = df['age'] > 18